## Plan Result (staging-uksouth-staging)




<pre><code>Plan: 142 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.casetracker.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.casetracker.azurerm_dns_zone.zone
  * module.casetracker.azurerm_role_assignment.dnszonecontributer
  * module.certificatedbailiffs.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.certificatedbailiffs.azurerm_dns_zone.zone
  * module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer
  * module.courtfines.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.courtfines.azurerm_dns_zone.zone
  * module.courtfines.azurerm_role_assignment.dnszonecontributer
  * module.hearings.azurerm_dns_cname_record.this[&#34;admin&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;afdverify.admin&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;afdverify.video&#34;]
  * module.hearings.azurerm_dns_cname_record.this[&#34;video&#34;]
  * module.hearings.azurerm_dns_zone.zone
  * module.hearings.azurerm_role_assignment.dnszonecontributer
  * module.immigrationappealsonline.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.immigrationappealsonline.azurerm_dns_zone.zone
  * module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer
  * module.public-dns.azurerm_dns_a_record.this[&#34;cvp-recording&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;cvp-recording-01&#34;]
  * module.public-dns.azurerm_dns_a_record.this[&#34;cvp-recording-02&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_4c2aa3cf7820ad559328554b0084d4af&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_8c25cc47acd71d289bc2b0f6163f17bd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;adoption-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.administer-orgs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.adoption-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.bar&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.benefit-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.civil-citizen-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.ds-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.et-sya&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fact&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fact-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fees-register&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fis-ds-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.gateway-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.immigration-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.lau&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.manage-case&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.manage-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.moneyclaims&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.moneyclaims-legal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.nfdiv&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.nfdiv-apply-for-divorce&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.nfdiv-end-civil-partnership&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.paybubble&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.pcq&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.pet-app1&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.privatelaw&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.probate&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.reformscanstg&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.register-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.return-case-doc-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.rpts&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.sscs-cor&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.track-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.wa-proto-frontend&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;bar&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;benefit-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;civil-citizen-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;decree-absolute-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;decree-nisi-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;ds-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;em2383.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;et-sya&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fact&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fact-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fees-register&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fis-ds-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;gateway-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;immigration-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;lau&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;manage-case&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;manage-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;moneyclaims&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;moneyclaims-legal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv-apply-for-divorce&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv-end-civil-partnership&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;paymentoutcome-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;pcq&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;petitioner-frontend-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;privatelaw&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;probate&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;reformscan&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;reformscanstg&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;register-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;respond-divorce-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;return-case-doc-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;rpts&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;sscs-cor&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;track-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;wa-proto-frontend&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;www.paymentoutcome-web&#34;]
  * module.public-dns.azurerm_dns_zone.zone
  * module.public-dns.azurerm_role_assignment.dnszonecontributer
  * module.staging.azurerm_dns_a_record.this[&#34;tax-tribunals&#34;]
  * module.staging.azurerm_dns_a_record.this[&#34;tax-tribunals-downloader&#34;]
  * module.staging.azurerm_dns_a_record.this[&#34;vh-wowza-public&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;_a7c390b60c8a53c3d0bc0ed7f0b93d43&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.c100-application&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.hmi-apim&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.pip&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.pip-frontend&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.toffee&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.vh&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.vh-admin-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.vh-service-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.vh-test-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.vh-video-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;afdverify.vh-wowza&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;c100-application&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;pip-frontend&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;sign-in.pip-frontend&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;staff.pip-frontend&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;toffee&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;vh-admin-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;vh-service-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;vh-test-web&#34;]
  * module.staging.azurerm_dns_cname_record.this[&#34;vh-video-web&#34;]
  * module.staging.azurerm_dns_zone.zone
  * module.staging.azurerm_role_assignment.dnszonecontributer
  * module.tribunalsdecisions.azurerm_dns_a_record.this[&#34;@&#34;]
  * module.tribunalsdecisions.azurerm_dns_zone.zone
  * module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.casetracker.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontdoors/sdshmcts-stg"
      + ttl                 = 60
      + zone_name           = "staging.casetracker.justice.gov.uk"
    }

  # module.casetracker.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.casetracker.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.casetracker.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.certificatedbailiffs.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontdoors/sdshmcts-stg"
      + ttl                 = 60
      + zone_name           = "staging.certificatedbailiffs.justice.gov.uk"
    }

  # module.certificatedbailiffs.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.certificatedbailiffs.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.certificatedbailiffs.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.courtfines.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontdoors/sdshmcts-stg"
      + ttl                 = 60
      + zone_name           = "staging.courtfines.direct.gov.uk"
    }

  # module.courtfines.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.courtfines.direct.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.courtfines.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.hearings.azurerm_dns_cname_record.this["admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "admin"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["afdverify.admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.admin"
      + record              = "afdverify.sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["afdverify.video"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.video"
      + record              = "afdverify.sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_cname_record.this["video"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "video"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.hearings.hmcts.net"
    }

  # module.hearings.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.hearings.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.hearings.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.immigrationappealsonline.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontdoors/sdshmcts-stg"
      + ttl                 = 60
      + zone_name           = "staging.immigrationappealsonline.justice.gov.uk"
    }

  # module.immigrationappealsonline.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.immigrationappealsonline.justice.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.immigrationappealsonline.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.public-dns.azurerm_dns_a_record.this["cvp-recording"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording"
      + records             = [
          + "20.49.129.252",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["cvp-recording-01"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording-01"
      + records             = [
          + "20.49.130.27",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_a_record.this["cvp-recording-02"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cvp-recording-02"
      + records             = [
          + "20.49.129.95",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["_4c2aa3cf7820ad559328554b0084d4af"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_4c2aa3cf7820ad559328554b0084d4af"
      + record              = "A8DE39B21BE7C0E63C7D0233E683637A.205D792E60EE2E5C66131C38BCD98C87.aad64398a969ec318680.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["_8c25cc47acd71d289bc2b0f6163f17bd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_8c25cc47acd71d289bc2b0f6163f17bd"
      + record              = "C648764CDB3F90B8D135D9335993A767.ABBA811E0AD75A1ABB2EB5C0CDCD5B0F.wiRpxFcZvwUNTJeY5mtL.comodoca.com"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 900
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["administer-orgs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "administer-orgs"
      + record              = "hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["adoption-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "adoption-web"
      + record              = "hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.administer-orgs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.administer-orgs"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.adoption-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.adoption-web"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.bar"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.bar"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.benefit-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.benefit-appeal"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.cft-api-mgmt"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.civil-citizen-ui"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.civil-citizen-ui"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.ds-ui"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.ds-ui"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.et-sya"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.et-sya"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl 

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["wa-proto-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "wa-proto-frontend"
      + record              = "hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["www.paymentoutcome-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.paymentoutcome-web"
      + record              = "hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "aat.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "aat.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.staging.azurerm_dns_a_record.this["tax-tribunals"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tax-tribunals"
      + records             = [
          + "52.151.100.245",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_a_record.this["tax-tribunals-downloader"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tax-tribunals-downloader"
      + records             = [
          + "52.151.100.245",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_a_record.this["vh-wowza-public"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-wowza-public"
      + records             = [
          + "20.254.40.90",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["_a7c390b60c8a53c3d0bc0ed7f0b93d43"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_a7c390b60c8a53c3d0bc0ed7f0b93d43"
      + record              = "8A49378F10CA1DB2BDFB0BC43E68D2EF.4119A1D9C9464645E90F4FCE3A4610AA.6fb41c898918ad5a0df0.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.c100-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.c100-application"
      + record              = "afdverify.sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.hmi-apim"
      + record              = "afdverify.hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.pip"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.pip"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.pip-frontend"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sds-api-mgmt"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.toffee"
      + record              = "afdverify.sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.vh"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.vh-admin-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-admin-web"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.vh-service-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-service-web"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.vh-test-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-test-web"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.vh-video-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-video-web"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["afdverify.vh-wowza"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.vh-wowza"
      + record              = "afdverify.hmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["c100-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "c100-application"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-aat.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pip-frontend"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["sign-in.pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sign-in.pip-frontend"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["staff.pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "staff.pip-frontend"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["vh-admin-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-admin-web"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["vh-service-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-service-web"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["vh-test-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-test-web"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_cname_record.this["vh-video-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-video-web"
      + record              = "sdshmcts-stg.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "staging.platform.hmcts.net"
    }

  # module.staging.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.staging.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.tribunalsdecisions.azurerm_dns_a_record.this["@"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "@"
      + resource_group_name = "reformmgmtrg"
      + target_resource_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontdoors/sdshmcts-stg"
      + ttl                 = 60
      + zone_name           = "staging.tribunalsdecisions.service.gov.uk"
    }

  # module.tribunalsdecisions.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "staging.tribunalsdecisions.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.tribunalsdecisions.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2cab9ccf-e755-4b58-a6b6-692705f3e79d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 142 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"staging-uksouth-staging","Vars":{}} -->